import re
# Эти задачи необходимо решить используя регулярные выражения!

# Задача - 1
# Запросите у пользователя имя, фамилию, email. Теперь необходимо совершить проверки, имя и фамилия должны иметь заглавные первые буквы.
# email - не должен иметь заглавных букв и должен быть в формате: текст в нижнем регистре, допускается нижнее подчеркивание и цифры, потом @, потом текст, допускаются цифры, точка, ru или org или com.
# Например:
# Пупкин василий - неверно указано имя, te$T@test.net - неверно указан email (спецсимвол, заглавная буква, .net), te_4_st@test.com - верно указан.


pattern_user = '([А-Я][а-я]+)'
pattern_email = '([a-zA-Z0-9_]+@[a-z]+\.ru|org|com)'
name = input('Введите ваше имя: ')
surname = input('Введите вашу фамилию: ')
email = input('Введите ваш email: ')
while True:
    if re.match(pattern_user, name) is None or re.match(pattern_user, surname) is None:
      print(name,surname,'Имя и фамилия должны начинаться с большой буквы')
    elif re.match(pattern_email, email) is None:
      print('Неверно указан email (спецсимвол, заглавная буква,неверный домен')
    else:
        print('Успех!')
        break








# Задача - 2:
# Вам дан текст.
#Необходимо с помощью регулярных выражений определить есть ли в тексте подряд
# более одной точки, при любом исходе сообщите результат пользователю!
some_str = '''
Мороз и солнце; день чудесный!
Еще ты дремлешь, друг прелестный —
Пора, красавица, проснись:
Открой сомкнуты негой взоры
Навстречу северной Авроры,
Звездою севера явись!
Вечор, ты помнишь, вьюга злилась,
На мутном небе мгла носилась;
Луна, как бледное пятно,
Сквозь тучи мрачные желтела,
И ты печальная сидела —
А нынче... погляди в окно:
Под голубыми небесами
Великолепными коврами,
Блестя на солнце, снег лежит;
Прозрачный лес один чернеет,
И ель сквозь иней зеленеет,
И речка подо льдом блестит.
Вся комната янтарным блеском
Озарена. Веселым треском
Трещит затопленная печь.
Приятно думать у лежанки.
Но знаешь: не велеть ли в санки
Кобылку бурую запречь?
Скользя по утреннему снегу,
Друг милый, предадимся бегу
Нетерпеливого коня
И навестим поля пустые,
Леса, недавно столь густые,
И берег, милый для меня.'''
pattern = '(\.\.+)'
print(f'В тексте встречается больше одной точки подряд {len(re.findall(pattern,some_str))} раз(а)')
